; domain
(define (domain crash-d)
    (:requirements :adl)

    (:types
        car lane altitude direction - object
    )

    (:constants
        agent - car
        left straight right stop - direction
    )

    (:predicates
        (isEqual ?C1 - car ?C2 - car)
        (hasPosition ?C - car ?L - lane ?A - altitude)
        (hasDirection ?C - car ?D - direction)
        (nextLane ?D - direction ?L1 - lane ?L2 - lane)
        (nextAltitude ?D - direction ?A1 - altitude ?A2 - altitude)
        (hasCrashed ?C1 - car)
        (updatedCrashes)
    )

    (:action changeDirection
        :parameters (?D1 - direction ?D2 - direction)
        :precondition (and
            (updatedCrashes)
            (hasDirection agent ?D1))
        :effect (and
            (not (hasDirection agent ?D1))
            (hasDirection agent ?D2))
    )

    (:action updateCrashes
        :parameters ()
        :precondition (not (updatedCrashes))
        :effect (and
            (updatedCrashes)
            (forall
                (?C1 - car ?C2 - car ?A1 - altitude ?L1 - lane)
                (when
                    (and
                        (not (isEqual ?C1 ?C2))
                        (not (hasCrashed ?C1))
                        (hasPosition ?C1 ?L1 ?A1)
                        (hasPosition ?C2 ?L1 ?A1))
                    (and
                        (hasCrashed ?C1)
                        (hasCrashed ?C2)
                    ))))
    )

    (:action go
        :parameters ()
        :precondition (updatedCrashes)
        :effect (and
            (not (updatedCrashes))
            (forall
                (?C1 - car ?D1 - direction ?A1 - altitude ?A2 - altitude ?L1 - lane ?L2 - lane)
                (when
                    (and
                        (not (hasCrashed ?C1))
                        (hasPosition ?C1 ?L1 ?A1)
                        (hasDirection ?C1 ?D1)
                        (nextLane ?D1 ?L1 ?L2)
                        (nextAltitude ?D1 ?A1 ?A2))
                    (and
                        (not (hasPosition ?C1 ?L1 ?A1))
                        (hasPosition ?C1 ?L2 ?A2))))
        )
    )
)

; problem
(define (problem crash-p-01)
    (:domain crash-d)
    (:objects
        c1 c2 - car
        l1 l2 l3 - lane
        a1 a2 a3 a4 a5 - altitude
    )
    (:init
        (updatedCrashes)

        (isEqual agent agent)
        (isEqual c1 c1)
        (isEqual c2 c2)

        (hasPosition agent l2 a1)
        (hasPosition c1 l1 a1)
        (hasPosition c2 l3 a1)

        (hasDirection agent straight)
        (hasDirection c1 right)
        (hasDirection c2 straight)

        (nextLane stop l1 l1)
        (nextLane stop l2 l2)
        (nextLane stop l3 l3)
        (nextLane straight l1 l1)
        (nextLane straight l2 l2)
        (nextLane straight l3 l3)
        (nextLane right l1 l2)
        (nextLane right l2 l3)
        (nextLane right l3 l3)
        (nextLane left l1 l1)
        (nextLane left l2 l1)
        (nextLane left l3 l2)

        (nextAltitude stop a1 a1)
        (nextAltitude stop a2 a2)
        (nextAltitude stop a3 a3)
        (nextAltitude stop a4 a4)
        (nextAltitude stop a5 a5)
        (nextAltitude straight a1 a2)
        (nextAltitude straight a2 a3)
        (nextAltitude straight a3 a4)
        (nextAltitude straight a4 a5)
        (nextAltitude left a1 a2)
        (nextAltitude left a2 a3)
        (nextAltitude left a3 a4)
        (nextAltitude left a4 a5)
        (nextAltitude right a1 a2)
        (nextAltitude right a2 a3)
        (nextAltitude right a3 a4)
        (nextAltitude right a4 a5)
    )

    (:goal
        (and (hasPosition agent l3 a5)
            (not (hasCrashed agent)))
    )
)

; plan
1. (changedirection straight left)
   deleted: (hasdirection agent straight)
   added: (hasdirection agent left)
   goals met: 1 of 2
2. (go)
   deleted: (updatedcrashes) (hasposition agent l2 a1) (hasposition c1 l1 a1) (hasposition c2 l3 a1)
   added: (hasposition agent l1 a2) (hasposition c1 l2 a2) (hasposition c2 l3 a2)
   goals met: 1 of 2
3. (updatecrashes)
   added: (updatedcrashes)
   goals met: 1 of 2
4. (changedirection left right)
   deleted: (hasdirection agent left)
   added: (hasdirection agent right)
   goals met: 1 of 2
5. (go)
   deleted: (updatedcrashes) (hasposition agent l1 a2) (hasposition c1 l2 a2) (hasposition c2 l3 a2)
   added: (hasposition agent l2 a3) (hasposition c1 l3 a3) (hasposition c2 l3 a3)
   goals met: 1 of 2
6. (updatecrashes)
   added: (updatedcrashes) (hascrashed c1) (hascrashed c2)
   goals met: 1 of 2
7. (go)
   deleted: (updatedcrashes) (hasposition agent l2 a3)
   added: (hasposition agent l3 a4)
   goals met: 1 of 2
8. (updatecrashes)
   added: (updatedcrashes)
   goals met: 1 of 2
9. (go)
   deleted: (updatedcrashes) (hasposition agent l3 a4)
   added: (hasposition agent l3 a5)
   goals met: 2 of 2
